title: Security Onion - Grid Node Login Failure (SSH)
id: 923421c7-9b1e-45d4-80cc-e21d060c8723
status: experimental
description: Detects when a user fails to login to a grid node via SSH. Review associated logs for username and source IP.
license: Elastic-2.0
author: 'Security Onion Solutions'
date: 2024/08/05
logsource:
    product: linux
    service: auth
detection:
    selection:
        process.name: 'sshd'
        event.outcome: 'failure'
        tags|contains: 'so-grid-node' # Only generate alerts for Grid Nodes
    filter:
        system.auth.ssh.method: '*' # Filters out duplicate logs
    condition: selection and not filter
falsepositives:
    - none
level: high
