title: The Security Onion Detections engine has entered a failure state
id: 40cfc50a-7105-40ee-a95d-520c39b790c5
status: experimental
description: The Security Onion Detections engine has entered a failure state.
license: Elastic-2.0
author: 'Security Onion Solutions'
date: 2024/09/12
references:
    - https://docs.securityonion.net/en/2.4/soc.html
tags:
    - grid.alerts
    - so.notification
logsource:
    product: SOC
    service: health
detection:
    selection:
        event.action: 'Detection engine has entered a failure state'
        event.dataset: soc.server
    condition: selection
level: medium