title: Security Onion - SOC Login Failure
id: bf86ef21-41e6-417b-9a05-b9ea6bf28a38
status: experimental
description: Detects when a user fails to login to the Security Onion Console (Web UI). Review associated logs for target username and source IP.
author: 'Security Onion Solutions'
date: 2024/03/06
logsource:
    product: kratos
    service: audit
detection:
    selection:
        msg: 'Encountered self-service login error.'
    condition: selection
falsepositives:
    - none
level: high
