title: The Security Onion Detections engine has returned to a healthy state
id: d43a269f-0fc3-4316-bbdd-ac371f3ace51
status: experimental
description: The Security Onion Detections engine has returned to a healthy state.
license: Elastic-2.0
author: 'Security Onion Solutions'
date: 2024/09/12
references:
    - https://docs.securityonion.net/en/2.4/soc.html
tags:
    - grid.alerts
    - so.notification
logsource:
    product: SOC
    service: health
detection:
    selection:
        event.action: 'Detection engine has returned to a healthy state'
        event.dataset: soc.server
    condition: selection
level: medium