title: Security Onion IDH - REDIS Action Command Attempt
id: 39ae3791-133c-4beb-bdf7-559e7a4cd428
status: experimental
description: Detects instances where a REDIS service on an OpenCanary node has had an action command attempted.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
modified: 2024/06/21 
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 17001
    condition: selection
falsepositives:
    - none
level: critical
