title: Security Onion IDH - Git Clone Request
id: 500b9d62-4bb8-43db-9e50-08438c3a3a07
status: experimental
description: Detects when the Git service on a SO Intrusion Detection Honeypot (IDH) node has had a git clone request.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 16001
    condition: selection
falsepositives:
    - none
level: critical