title: Security Onion IDH - MySQL Attempted Login
id: 9ee1021c-be7f-453d-81e8-8539403a2c5d
status: experimental
description: Detects when the MySQL service on a SO Intrusion Detection Honeypot (IDH) node has had a proxy login attempt.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 8001
    condition: selection
falsepositives:
    - none
level: critical