title: Security Onion IDH - HTTP Proxy Attempted Proxy Login
id: 5a365a62-7d5a-4d80-8435-488380dec0e2
status: experimental
description: Detects when the HTTP Proxy service on a SO Intrusion Detection Honeypot (IDH) node has had a proxy login attempt.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 7001
    condition: selection
falsepositives:
    - none
level: critical