title: Security Onion IDH - SIP Request
id: e4bbc094-ad58-4879-bec7-0ccc60a99a5b
status: experimental
description: Detects when the SIP service on a SO Intrusion Detection Honeypot (IDH) node has had a SIP request sent to it.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 15001
    condition: selection
falsepositives:
    - none
level: critical