title: Security Onion IDH - FTP Login Attempt
id: 40b9afdf-4322-433b-b812-b6f6751c4868
status: experimental
description: Detects when the FTP service on a SO Intrusion Detection Honeypot (IDH) node has had a login attempt.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 2000
    condition: selection
falsepositives:
    - none
level: critical