title: Security Onion IDH - MSSQL Attempted Login
id: e4eaf701-c8ed-4801-ba78-883c1856b298
status: experimental
description: Detects when the MS SQL service on a SO Intrusion Detection Honeypot (IDH) node has had a proxy login attempt.
license: Elastic-2.0
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
author: 'Security Onion Solutions'
date: 2024/05/17
logsource:
    product: opencanary
detection:
    selection:
        logtype:
            - 9001 # SQL Auth
            - 9002 # Windows Auth
    condition: selection
falsepositives:
    - none
level: critical